{"status":"ok","totalResults":1697,"articles":[{"source":{"id":"engadget","name":"Engadget"},"author":"Christine Fisher","title":"Hundreds of employees criticize Facebook's political ad policies","description":"Over the past month, Facebook has come under criticism for allowing politicians to run false or misleading ads. Now, employees are speaking out. More than 250 Facebook employees wrote a letter addressed to CEO Mark Zuckerberg and top Facebook officials callin…","url":"https://www.engadget.com/2019/10/28/facebook-employees-letter-political-ad-policies/","urlToImage":"https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D4914%252C3069%252C0%252C89%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1000%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-images%252F2019-10%252F6d250a00-f7c6-11e9-9777-513f92ff51c3%26client%3Da1acac3e1b3290917d92%26signature%3D8b92a3a7c276e32b8b7520b397ef0d7bf09a4483&client=amp-blogside-v2&signature=7189b380f16ec6e148b38e80a554d477167f7fbc","publishedAt":"2019-10-28T19:12:00Z","content":"In the letter, obtained by The New York Times, the employees argue that allowing misinformation to run could increase distrust in Facebook and undermine Facebook's integrity. They recommend six ways to remedy the situation, including holding political ads to … [+827 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Makena Kelly","title":"Facebook’s political ad ban created a disaster in Washington state","description":"It’s been a controversial decision — not least with the 2020 presidential frontrunners — but after Facebook’s ongoing fact-checking policy disaster, it’s an appealing option. Would we be better off if platforms just banned political ads entirely?","url":"https://www.theverge.com/2019/10/31/20941917/twitter-political-ads-ban-facebook-washington-state-bob-ferguson","urlToImage":"https://cdn.vox-cdn.com/thumbor/O3t-YbUpkAz9E1kFH_L2s4mUUUY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/12742467/acastro_180828_1777_facebook_0001.jpg","publishedAt":"2019-10-31T17:30:32Z","content":"A troubling omen for Twitters global ban\r\nIllustration by Alex Castro / The Verge\r\nOn Wednesday, Twitter announced that it will ban all forms of political advertising starting in November, opening up challenging questions about what role social media platform… [+6693 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Josh Constine","title":"Facebook staff demand Zuckerberg limit lies in politcal ads","description":"Submit campaign ads to fact checking, limit microtargeting, cap spending, observe silence periods, or at least warn users. These are the solutions Facebook employees put forward in an open letter pleading with CEO Mark Zuckerberg and company leadership to add…","url":"http://techcrunch.com/2019/10/28/facebook-employees-vs-ad-lies/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/09/Facebook-Policy.png?w=730","publishedAt":"2019-10-28T19:48:34Z","content":"Submit campaign ads to fact checking, limit microtargeting, cap spending, observe silence periods, or at least warn users. These are the solutions Facebook employees put forward in an open letter pleading with CEO Mark Zuckerberg and company leadership to add… [+10784 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Lucas Matney","title":"Week in Review: The web’s free speech conundrum","description":"Hey everyone. Thank you for welcoming me into you inbox yet again. Last week, I talked about the eternal dumbness of the smart home and how Google had a big chance to lay out their vision this past week. Guess what? They did not, instead we got a new more exp…","url":"http://techcrunch.com/2019/10/20/week-in-review-the-webs-free-speech-conundrum/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/10/Zuckerberg-Georgetown-Wideshot.png?w=764","publishedAt":"2019-10-20T16:21:22Z","content":"Hey everyone. Thank you for welcoming me into you inbox yet again.\r\nLast week, I talked about the eternal dumbness of the smart home and how Google had a big chance to lay out their vision this past week. Guess what? They did not, instead we got a new more ex… [+4633 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Bryan Menegus","title":"Even Facebook Employees Think the Company's Political Speech Policy Is Awful","description":"Mark Zuckerberg has been roundly criticized by the press and lawmakers for his company’s incongruous new policy allowing politicians to make false claims in advertising on the platform. Adding to that growing wave of dissent, according to the New York Times: …","url":"https://gizmodo.com/even-facebook-employees-think-the-companys-political-sp-1839419420","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/tczhupm4y8bunzvppou9.jpg","publishedAt":"2019-10-28T18:25:00Z","content":"Mark Zuckerberg has been roundly criticized by the press and lawmakers for his companys incongruous new policy allowing politicians to make false claims in advertising on the platform. Adding to that growing wave of dissent, according to the New York Times: s… [+7759 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ahiza Garcia, CNN Business","title":"Bill Gates: The problem with political ads is targeting, not fact-checking","description":"Bill Gates waded into the debate over political ads on social media platforms during an interview Wednesday, calling for some limitations while also siding with those who say the companies should not play the role of fact-checker.","url":"https://www.cnn.com/2019/11/06/tech/bill-gates-political-ad-targeting-fact-checking/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190708095939-bill-gates-2018-file-super-tease.jpg","publishedAt":"2019-11-06T23:15:10Z","content":"San Francisco (CNN Business)Bill Gates waded into the debate overpolitical ads on social media platforms during an interview Wednesday, calling for some limitations while also siding with those who say the companies should not play the role of fact-checker. \r… [+859 chars]"},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Kate Cox","title":"Facebook’s new political-ad policy already showing cracks, loopholes","description":"The company is trying to hold a firm line while the sands shift under it.","url":"https://arstechnica.com/tech-policy/2019/10/facebooks-new-political-ad-policy-already-showing-cracks-loopholes/","urlToImage":"https://cdn.arstechnica.net/wp-content/uploads/2019/07/getty-facebook-thumb-down-760x380.jpg","publishedAt":"2019-10-28T20:05:31Z","content":"0 with 0 posters participating\r\nIf you create a system, someone will try to game itthat's true of everything from Candyland to the tax code. And so we should be terribly surprised that Facebookwhich is desperately trying to create some kind of coherent system… [+3823 chars]"},{"source":{"id":null,"name":"Seths.blog"},"author":"Seth Godin","title":"Freelancing is a brave act","description":"When I quit my job in 1986 and went out on my own, it was shortly after my picture had appeared in a small feature in a national magazine. My grandmother proudly kept a copy of the magazine (not the article, the entire magazine) on her coffee table, proudly t…","url":"https://seths.blog/2019/10/freelancing-is-a-brave-act/","urlToImage":"https://seths.blog/wp-content/uploads/2018/06/seth_godin_ogimages_v02_18061311.jpg","publishedAt":"2019-10-15T08:14:56Z","content":"When I quit my job in 1986 and went out on my own, it was shortly after my picture had appeared in a small feature in a national magazine. My grandmother proudly kept a copy of the magazine (not the article, the entire magazine) on her coffee table, proudly t… [+1611 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Reuters","title":"Facebook is considering using 'stablecoins' pegged to the value of real-world currencies to power its digital currency efforts (FB)","description":"AP Photo/Andrew Harnik Facebook is considering using \"stablecoins\" to power its digital currency efforts. A stablecoin is a cryptocurrency pegged to the value of a real-world currency. Facebook's efforts to build Libra have been mired by criticism and several…","url":"https://www.businessinsider.com/facebook-considering-stablecoins-libra-project-david-marcus-2019-10","urlToImage":"https://image.businessinsider.com/5dad73594af90958ff2db6f2?width=1200&format=jpeg","publishedAt":"2019-10-21T09:45:19Z","content":"Facebook, facing growing skepticism about its digital currency project Libra, on Sunday said the initiative could use cryptocurrencies based on national currencies such as the dollar, instead of the synthetic one it initially proposed.\r\nDavid Marcus, who head… [+2097 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"feedback@businessinsider.com (Carmen Reinicke), Carmen Reinicke","title":"BANK OF AMERICA: Here are 14 of the top stock picks for traders seeking exposure to millennials and Gen Zers","description":"George Rose / Contributor / Getty Images Bank of America published an updated list of thematic stock picks. One of the themes is companies with high exposure to millennials and Gen Zers. The report breaks down companies by their exposure to young consumers th…","url":"https://www.businessinsider.com/baml-14-top-millennial-and-gen-z-exposed-stock-picks-2019-10","urlToImage":"","publishedAt":"2019-10-10T19:54:16Z","content":"George Rose / Contributor / Getty Images<ul><li>Bank of America published an updated list of thematic stock picks. One of the themes is companies with high exposure to millennials and Gen Zers. </li><li>The report breaks down companies by their exposure to yo… [+5009 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Pew Research","title":"Most Americans don't know Facebook owns Instagram and WhatsApp (FB)","description":"A majority of U.S. adults performed poorly on a digital knowledge quiz carried out by Pew Research, answering fewer than half of questions correctly. Most respondents didn't know that Facebook owns Instagram, for example, or that \"https://\" indicates that inf…","url":"https://www.businessinsider.com/most-americans-dont-know-facebook-owns-instagram-and-whatsapp-2019-10","urlToImage":"https://image.businessinsider.com/5b29428e1ae6621f008b4f26?width=1200&format=jpeg","publishedAt":"2019-10-09T20:25:47Z","content":"A new Pew Research Center survey finds that Americans' understanding of technology-related issues varies greatly depending on the topic, term or concept. While a majority of U.S. adults can correctly answer questions about phishing scams or website cookies, o… [+6723 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Mary Meisenzahl","title":"Facebook CEO Mark Zuckerberg is trying to build a legacy amid scandals and criticism (FB)","description":"On Thursday, Mark Zuckerberg defended Facebook's positions on freedom of speech at Georgetown University. Zuckerberg was interviewed at Facebook's headquarters by The New York Times ahead of the speech. In the speech and interview, Zuckerberg talked about the…","url":"https://www.businessinsider.com/facebook-mark-zuckerberg-wants-to-make-a-plan-for-facebooks-future-2019-10","urlToImage":"https://image.businessinsider.com/5da8b4a74af90907f72eb9b6?width=1200&format=jpeg","publishedAt":"2019-10-17T18:53:29Z","content":"In a live-streamed speech at Georgetown University on Thursday, Mark Zuckerberg laid out his thoughts on freedom of speech.\r\nZuckerberg used the moment to talk about his own legacy, and the legacy of Facebook. He told the New York Times that he gave the speec… [+2158 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Kevin Webb","title":"Facebook's Libra project suffers massive blow as MasterCard, Ebay, and Stripe withdraw (FB)","description":"MasterCard, Ebay, and Stripe are exiting Facebook's planned cryptocurrency project, Libra. PayPal also dropped out of talks to work with Facebook on Libra last week. Facebook's deteriorating relationships with potential Libra partners, combined with intense s…","url":"https://www.businessinsider.com/mastercard-ebay-stripe-leave-facebook-libra-cryptocurrency-project-payapl-2019-10","urlToImage":"https://image.businessinsider.com/5da0e1084af9092903269be3?width=1200&format=jpeg","publishedAt":"2019-10-11T20:08:27Z","content":"Ebay, Mastercard, and Stripe will no longer participate in the Libra Association, the group working to launch Facebook's proposed cryptocurrency, the Financial Times and Bloomberg reported on Friday.\r\nThe exits, combined with intense scrutiny from lawmakers, … [+1862 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Carmen Reinicke","title":"Facebook climbs on strong user growth in the US — a market previously thought tapped out (FB)","description":"Facebook reported third-quarter earnings Wednesday that exceeded Wall Street's expectations. The company also showed it grew users in the US and Canada, a key region where growth stumbled previously. Shares rose as much as 5% in early trading Thursday followi…","url":"https://www.businessinsider.com/facebook-stock-price-gains-on-q3-earnings-report-us-user-growth-2019-10","urlToImage":"https://image.businessinsider.com/5dbadb89dee0192bd3459572?width=1200&format=jpeg","publishedAt":"2019-10-31T14:03:28Z","content":"<ul><li>Facebook reported third-quarter earnings Wednesday that exceeded Wall Street's expectations.</li><li>The company also showed it grew users in the US and Canada, a key region where growth stumbled previously. </li><li>Shares rose as much as 5% in early… [+2597 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Daniel Strauss","title":"Facebook reports 3rd-quarter earnings on Wednesday. Here's what 5 analysts are thinking about ahead of the results. (FB)","description":"Facebook is expected to report third-quarter financial results after the closing bell on Wednesday. Analysts are expecting the social media giant's dominant digital advertising business to deliver steady revenue for the period. The company's stock has proved …","url":"https://www.businessinsider.com/facebook-q3-earnings-preview-analyst-commentary-leading-up-to-report-2019-10","urlToImage":"","publishedAt":"2019-10-30T15:56:44Z","content":"AP Photo/Andrew Harnik<ul><li>Facebook is expected to report third-quarter financial results after the closing bell on Wednesday. </li><li>Analysts are expecting the social media giant's dominant digital advertising business to deliver steady revenue for the … [+5092 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Aaron Holmes","title":"The company behind Facebook's nightmarish moderation center in Florida has canceled its contract with the social network (FB)","description":"Cognizant, a professional services firm whose employees moderate Facebook content, will end its services next year. Employees tasked with moderating Facebook content reportedly worked under nightmarish conditions exposed by a series of investigations publishe…","url":"https://www.businessinsider.com/facebook-content-moderator-cognizant-cancels-contract-2019-10","urlToImage":"https://image.businessinsider.com/5dbae6bddee019422b11b9b2?width=1200&format=jpeg","publishedAt":"2019-10-31T14:06:44Z","content":"Cognizant, a firm that Facebook pays to moderate content on the social media platform, will cut its content moderation services next year, Facebook confirmed Thursday morning.\r\nA series of investigations published by The Verge and the Tampa Bay Times earlier … [+1673 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Ashley Stewart","title":"Facebook is quietly laying the foundation for its own HQ2-style expansion by leasing enough office space in Seattle for 20,000 employees (FB)","description":"Facebook leased a large building in a Seattle suburb, and now has nearly 3 million square feet in the area, the company confirms. The Seattle area is already the company's largest engineering outpost — with this lease secured it has enough space for an estima…","url":"https://www.businessinsider.com/facebook-expands-seattle-largest-engineering-outpost-2019-11","urlToImage":"https://image.businessinsider.com/5dc0956b7eece51d5e616795?width=1200&format=jpeg","publishedAt":"2019-11-04T21:27:31Z","content":"Facebook signed a lease for a large building in a Seattle suburb, Business Insider has learned, cementing the Seattle area as the company's largest engineering outpost.\r\nThe Menlo Park, California-based company leased a 325,000-square-foot building called Blo… [+2743 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Rob Price","title":"Facebook fought to keep a trove of thousands of explosive internal documents and emails secret. They were just published online in full. (FB)","description":"Thousands of pages of internal Facebook documents have been published, shedding new light on how the company profited off user data and grappled with rivals. The documentation was collected as part of a lawsuit involving Facebook and a developer it took actio…","url":"https://www.businessinsider.com/facebook-internal-documents-executive-emails-published-six4three-court-leak-2019-11","urlToImage":"https://image.businessinsider.com/5dc2dce23afd3720fd32c8f6?width=1200&format=jpeg","publishedAt":"2019-11-06T15:58:30Z","content":"An explosive trove of nearly 4,000 pages of confidential internal Facebook documentation has been made public, shedding unprecedented light on the inner workings of the Silicon Valley social networking giant.\r\nOn Wednesday, investigative reporter Duncan Campb… [+2317 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Will Fischer","title":"Facebook is acting like a broadcast station when it comes to running ads from politicans. What if the FCC regulated it like one? (FB)","description":"Facebook said it agreed with the Federal Communications Commission's rules for broadcast stations — which are required to run all ads from political candidates — in a public spat with Elizabeth Warren over its decision to allow ads containing false informatio…","url":"https://www.businessinsider.com/fcc-regulate-facebook-broadcast-station-politicians-ads-2019-10","urlToImage":"https://image.businessinsider.com/5da623cccc4a0a32c67366c4?width=1200&format=jpeg","publishedAt":"2019-10-15T21:53:48Z","content":"What is Facebook? Depending on where and when it's asked, sometimes it's a publisher, and sometimes it's a platform. \r\nBut in its latest controversy — the decision to not fact-check ads from politicians — Facebook is positioning itself as most like a broadcas… [+4280 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Ben Gilbert","title":"Facebook's head of news defends the company's decision to include sites like Breitbart in its curated News section: 'I will always stand by their right to express their views' (FB)","description":"Facebook's head of news partnerships, Campbell Brown, defended Facebook's choice to include sites like Breitbart in its new News tab in a Facebook post on Wednesday. \"We should include content from ideological publishers on both the left and the right — as lo…","url":"https://www.businessinsider.com/facebook-campbell-brown-defends-far-right-sites-news-section-2019-10","urlToImage":"https://image.businessinsider.com/5db9d1e1dee0192697146b33?width=1200&format=jpeg","publishedAt":"2019-10-30T19:16:11Z","content":"Facebook's head of news partnerships, Campbell Brown, is defending the company's decision to include sites like Breitbart News in Facebook's recently announced News tab.\r\n\"I believe that in building out a destination for news on Facebook, we should include co… [+2744 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Eliza Relman","title":"Democrats are starting to freak out over Facebook's policy that allows political ads with lies","description":"Rep. Alexandria Ocasio-Cortez and other Democratic lawmakers grilled Facebook CEO Mark Zuckerberg on his company's newly-confirmed policy of allowing politicians to lie in ads on the social media site. Facebook argues that rejecting political ads that promote…","url":"https://www.businessinsider.com/democrats-starting-freak-out-over-facebook-allowing-lies-political-ads-2019-10","urlToImage":"https://image.businessinsider.com/5db1f939dee019769c4ededc?width=1200&format=jpeg","publishedAt":"2019-10-24T19:21:51Z","content":"Rep. Alexandria Ocasio-Cortez and other Democratic lawmakers grilled Facebook CEO Mark Zuckerberg on his company's newly-confirmed policy of not fact-checking, suppressing, or removing political ads that promote falsehoods. \r\nAside from content that calls \"fo… [+5891 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Dominick Reuter","title":"Amazon says these are the 6 best small business owners under 30 selling on its platform. We asked them to share their keys to successful entrepreneurship.","description":"Amazon announced the finalists for its first-ever Small Business of the Year awards last week, and there was a special category for Owners Under 30. The 6 finalists for the Under-30 category hail from across the US, and offer innovative products for fun, heal…","url":"https://www.businessinsider.com/amazons-small-business-owners-under-30-share-keys-successful-entrepreneurship-2019-10","urlToImage":"https://image.businessinsider.com/5db07b144af9092e01786586?width=1200&format=jpeg","publishedAt":"2019-10-23T19:24:51Z","content":null},{"source":{"id":null,"name":"Mindanews.com"},"author":"Mindanews","title":"Davao del Sur's Petecio is AIBA Women's World Boxing champ - Minda News","description":"Davao del Sur's Petecio is AIBA Women's World Boxing champ Minda News Boxing: Nesthy Petecio bags the gold in Women's World tilt ABS-CBN News Nesthy Petecio wins gold in boxing world championships INQUIRER.net PH's Nesthy Petecio bags gold in women's world bo…","url":"https://www.mindanews.com/sports/2019/10/davao-del-surs-petecio-is-aiba-womens-world-boxing-champ/","urlToImage":"https://i0.wp.com/www.mindanews.com/wp-content/uploads/2019/10/14petecio.jpg?fit=598%2C600&ssl=1","publishedAt":"2019-10-14T00:48:17Z","content":"DAVAO CITY (MindaNews / 14 October) The new champion in the AIBA Womens World Boxing featherweight division is a Mindanawon from Sta. Cruz in Davao del Sur.\r\nThe 27-year old Nesthy Alcayde Petecio on Sunday won the AIBA Womens World Boxing Championship in Ula… [+3102 chars]"},{"source":{"id":null,"name":"Coconuts.co"},"author":"CoconutsManila","title":"Fourth polio case detected in Mindanao, Health Department says - Coconuts","description":"The Philippines' Health Department announced last night that another person has tested positive for polio, making them the fourth confirmed case of the debilitating disease since it resurfaced in the country after an almost 20-year absence A...","url":"https://coconuts.co/manila/news/fourth-polio-case-detected-in-mindanao-health-department-says/","urlToImage":"https://coconuts.co/wp-content/uploads/2019/10/Mark-Demayo-polio.jpg","publishedAt":"2019-11-06T05:07:46Z","content":"The Philippines’ Health Department announced last night that another person has tested positive for polio, making them the fourth confirmed case of the debilitating disease since it resurfaced in the country after an almost 20-year absence.\r\nA statement poste… [+2131 chars]"},{"source":{"id":null,"name":"Manilatimes.net"},"author":"Mayvelin U. Caraballo, TMT","title":"BSP sees better PH growth in H2 - The Manila Times","description":"BSP sees better PH growth in H2 The Manila Times BSP: Oil price volatility, swine fever woes may push up inflation in 2020 INQUIRER.net ASF, volatile oil prices may push inflation up in 2020 — BSP BusinessWorld Online Bangko Sentral seen to pause rate cuts fo…","url":"https://www.manilatimes.net/2019/10/26/business/business-top/bsp-sees-better-ph-growth-in-h2/651061/","urlToImage":"https://www.manilatimes.net/wp-content/uploads/2019/10/Governor-Francisco-Dakila-Jr.jpg","publishedAt":"2019-10-25T20:23:25Z","content":"CENTRAL bank models suggest that Philippine economic growth in the last two quarters of the year would be much better than in the first two, according to a senior Bangko Sentral ng Pilipino (BSP) official.\r\nBSP Deputy Governor Francisco Dakila Jr. Photo from … [+2021 chars]"},{"source":{"id":null,"name":"Investors.com"},"author":"KEN SHREVE","title":"Dow Jones Holds 27000 Level As Pfizer, Merck Soar On Earnings - Investor's Business Daily","description":"Dow Jones Holds 27000 Level As Pfizer, Merck Soar On Earnings Investor's Business Daily S&P 500 record: How much higher can US stocks go? CNN Global markets dip as week of earnings, reports heats up KSL.com The wrong kind of stocks are leading the stock marke…","url":"http://www.investors.com/market-trend/stock-market-today/dow-jones-pfizer-earnings-merck-earnings/","urlToImage":"https://www.investors.com/wp-content/uploads/2017/03/stock-nyse-23-shutter.jpg","publishedAt":"2019-10-29T20:25:18Z","content":"The stock market ended lower Tuesday, but the Dow Jones held the 27,000 level and the S&amp;P 500 hit another new high intraday. Pfizer (PFE) and Merck (MRK) were top gainers in the Dow Jones today, while an earnings miss at Google-parent Alphabet (GOOGL) wei… [+2910 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Facebook stock jumps after revenue, earnings beat expectations in Q3 - Yahoo Finance","description":"Facebook stock jumps after revenue, earnings beat expectations in Q3 Yahoo Finance Facebook shares pop after revenue jumps 29% MarketWatch Facebook Reports Growth in Revenue, Users The Wall Street Journal Facebook reports record revenue The Washington Post Fa…","url":"https://finance.yahoo.com/news/facebook-q3-earnings-report-165935295.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/gvVUges5r36U53kRtBJatw--~B/aD0zMDcyO3c9NDYwODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/2e15b870-e49b-11e9-97df-0bff4ac4372f","publishedAt":"2019-10-30T16:59:00Z","content":"Facebook (FB) posted third quarter earnings per share that beat Wall Streets expectations, boosted by a 28% surge in advertising revenue despite controversies over its data policies, political ads and cryptocurrency plans.\r\nHere are the key numbers from the s… [+4044 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Stock market news: November 1, 2019 - Yahoo Finance","description":"U.S. stocks jumped Friday after the October jobs report came in well above consensus expectations. Treasury yields climbed and gold prices fell, as investors piled into risk assets.","url":"https://finance.yahoo.com/news/stock-market-news-november-1-2019-120850971.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/7ikVZLLYkSo5XOvBn.o5xw--~B/aD0zODQwO3c9NTc2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-11/6d81bf10-fc9f-11e9-9acf-3ae396388fa8","publishedAt":"2019-11-01T12:45:00Z","content":"U.S. stocks jumped Friday and the S&amp;P 500 hit a record intraday high after the October jobs report came in well above consensus expectations. Treasury yields climbed and gold prices fell, as investors piled into risk assets.\r\nHere were the main moves in m… [+4110 chars]"},{"source":{"id":null,"name":"Www.tsn.ca"},"author":"The Canadian Press","title":"Patriots force 4 turnovers, beat Giants to reach 6-0 - TSN","description":"Tom Brady had two touchdown runs and moved ahead of Peyton Manning for second place on the NFL's all-time passing yards list as the New England Patriots pulled away for a 35-14 victory over the New York Giants on Thursday night.","url":"https://www.tsn.ca/patriots-force-4-turnovers-beat-giants-35-14-to-reach-6-0-1.1379653","urlToImage":"https://www.tsn.ca/polopoly_fs/1.1379640!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/chase-winovich-deatrich-wise.jpg","publishedAt":"2019-10-11T03:41:34Z","content":"FOXBOROUGH, Mass. Under coach Bill Belichick, the Patriots have made a habit of besting young quarterbacks.\r\nThey can add Giants rookie Daniel Jones to that list.\r\nTom Brady had two touchdown runs and moved ahead of Peyton Manning for second place on the NFL'… [+4782 chars]"},{"source":{"id":null,"name":"Globalnews.ca"},"author":"Sean Boynton","title":"Scheer defends Conservative Chinese Facebook ads saying Trudeau will legalize hard drugs - Global News","description":"Scheer defends Conservative Chinese Facebook ads saying Trudeau will legalize hard drugs Global News Scheer, Singh make confident pitch to voters, Trudeau targets both as polls move to favour Conservatives CBC.ca Conservatives running Facebook ads falsely acc…","url":"http://globalnews.ca/news/6025644/conservative-facebook-ads-drugs-liberals/","urlToImage":"https://shawglobalnews.files.wordpress.com/2019/10/tory-ads-e1570908168228.jpg?quality=70&strip=all&w=720&h=379&crop=1","publishedAt":"2019-10-12T21:19:38Z","content":"Conservative Leader Andrew Scheer is defending his party’s decision to run Facebook advertisements claiming the Liberals plan to decriminalize hard drugs.\r\nBut speaking at an event in Burnaby Saturday, he would not say why those ads have only been published i… [+5212 chars]"},{"source":{"id":null,"name":"Readwrite.com"},"author":"Marjory Gentry","title":"Design Product with Consumer Privacy in Mind","description":"Why can’t products be designed with consumer privacy in mind? A recent controversy surrounding FaceApp collecting its users’ images has brought to light several data privacy issues. We only need to look at FB terms and conditions agreement to see that consume…","url":"https://readwrite.com/2019/10/16/design-product-with-consumer-privacy-in-mind/","urlToImage":"https://images.readwrite.com/wp-content/uploads/2019/08/Design-Product-with-Consumer-Privacy-in-Mind-900x600.jpg","publishedAt":"2019-10-16T18:00:55Z","content":"Why can’t products be designed with consumer privacy in mind? A recent controversy surrounding FaceApp collecting its users images has brought to light several data privacy issues. We only need to look at FB terms and conditions agreement to see that consumer… [+4217 chars]"},{"source":{"id":null,"name":"Readwrite.com"},"author":"Joel Comm","title":"Why Libra Regulations Will Be Good for Cryptocurrencies","description":"Facebook’s Libra landed with a splash. It’s since drifted into stormy waters. What Mark Zuckerberg might have seen as a simple way for his users to send and receive money online — governments and regulators have taken to a whole new level. Some have seen an e…","url":"https://readwrite.com/2019/11/04/why-libra-regulations-will-be-good-for-cryptocurrencies/","urlToImage":"https://images.readwrite.com/wp-content/uploads/2019/10/Why-Libra-Regulations-Will-Be-Good-for-Cryptocurrencies.jpg","publishedAt":"2019-11-04T16:00:53Z","content":"Facebooks Libra landed with a splash. Its since drifted into stormy waters. What Mark Zuckerberg might have seen as a simple way for his users to send and receive money online — governments and regulators have taken to a whole new level. Some have seen an evi… [+3478 chars]"},{"source":{"id":null,"name":"Readwrite.com"},"author":"Joel Comm","title":"The Top 5 Issues Faced by Futurists","description":"Technology affects every aspect of our lives. It affects the way we communicate, and how we travel, but it also determines how we learn, how we bank, and the way we run our businesses. Futurist speakers think about those changes and try to understand how they…","url":"https://readwrite.com/2019/10/23/the-top-5-issues-faced-by-futurists/","urlToImage":"https://images.readwrite.com/wp-content/uploads/2019/09/The-Top-5-Issues-Faced-by-Futurists.jpg","publishedAt":"2019-10-24T00:00:29Z","content":"Technology affects every aspect of our lives. It affects the way we communicate, and how we travel, but it also determines how we learn, how we bank, and the way we run our businesses. Futurist speakers think about those changes and try to understand how they… [+3554 chars]"},{"source":{"id":null,"name":"Boingboing.net"},"author":"Xeni Jardin","title":"WhatsApp fixes security bug that let hackers take over with a GIF","description":"A spokesperson for the Facebook-owned WhatsApp says the company has fixed a security vulnerability that let hackers take control of the messaging app by way of a malicious GIF. \"We have no reason to believe this affected any users, though of course we are alw…","url":"https://boingboing.net/2019/10/08/whatsapp-fixes-security-bug-th.html","urlToImage":"https://i2.wp.com/media.boingboing.net/wp-content/uploads/2016/05/WhatsApp.jpg?fit=699%2C420&ssl=1","publishedAt":"2019-10-08T19:48:57Z","content":"A spokesperson for the Facebook-owned WhatsApp says the company has fixed a security vulnerability that let hackers take control of the messaging app by way of a malicious GIF.\r\n\"We have no reason to believe this affected any users, though of course we are al… [+2442 chars]"},{"source":{"id":"the-next-web","name":"The Next Web"},"author":"Cara Curtis","title":"Facebook employees object to the company’s policy of allowing lies in political ads","description":"With just over a year left until the 2020 US presidential elections, Facebook updated its policies on the spread of misinformation last week and released a bunch of new tools to better “protect the democratic process.” Now, Facebook will clearly label false p…","url":"https://thenextweb.com/tech/2019/10/29/facebook-employees-object-to-the-companys-policy-of-allowing-lies-in-political-ads/","urlToImage":"https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2F200-calories-12.png&signature=880c9e1678c162b026e77fd0ebd5ea40","publishedAt":"2019-10-29T11:12:29Z","content":"With just over a year left until the 2020 US presidential elections, Facebook updated its policies on the spread of misinformation last week and released a bunch of new tools to better protect the democratic process. Now, Facebook will clearly label false pos… [+3127 chars]"},{"source":{"id":null,"name":"Ikeahackers.net"},"author":"Jules Yap","title":"Q: What do you do with leftover IKEA hardware?","description":"Over at the IKEAhackers Community FB Group, Christina posted an interesting question: “What do you all do with leftover IKEA hardware? I have so many bits of things even for pieces I no longer own … any suggestions?” She mentions that she is selling some of t…","url":"https://www.ikeahackers.net/2019/11/ikea-hardware-leftover.html","urlToImage":"https://www.ikeahackers.net/wp-content/uploads/2019/11/ikea-hardware-hex-maze-1.png","publishedAt":"2019-11-07T02:00:47Z","content":"Over at the IKEAhackers Community FB Group, Christina posted an interesting question: \r\n“What do you all do with leftover IKEA hardware? I have so many bits of things even for pieces I no longer own … any suggestions?”\r\nShe mentions that she is selling some o… [+1908 chars]"},{"source":{"id":null,"name":"Socialmediaexaminer.com"},"author":"Grace Duffy","title":"Facebook Page Verification: What Marketers Need to Know","description":"Welcome to this week’s edition of the Social Media Marketing Talk Show, a news show for marketers who want to stay on the leading edge of social media. On this week’s Social Media Marketing Talk Show, we explore what marketers need to know about changes to ve…","url":"https://www.socialmediaexaminer.com/facebook-page-verification-what-marketers-need-to-know/","urlToImage":"https://www.socialmediaexaminer.com/wp-content/uploads/2019/07/SMMTalkShow-1200.png","publishedAt":"2019-10-26T10:00:23Z","content":"Welcome to this week’s edition of the Social Media Marketing Talk Show, a news show for marketers who want to stay on the leading edge of social media.\r\nOn this week’s Social Media Marketing Talk Show, we explore what marketers need to know about changes to v… [+6630 chars]"},{"source":{"id":null,"name":"Digitaltrends.com"},"author":"Hillary K. Grigonis","title":"Facebook rebrands to make its ‘monopoly’ more obvious across apps","description":"Facebook has a new look -- no, not that Facebook, Facebook the company. The change is designed to differentiate the company from the network, as well as make Facebook's ownership of other apps more obvious. The new logo uses simple text, but comes in many dif…","url":"https://www.digitaltrends.com/social-media/facebook-logo-update-2019/","urlToImage":"https://icdn3.digitaltrends.com/image/digitaltrends/new-facebook-company-brand-1200x630-c-ar1.91.jpg","publishedAt":"2019-11-04T18:25:06Z","content":"Facebook has a new look designed to differentiate Facebook-the-company from Facebook-the-network while simultaneously making its ownership of other apps more obvious. On Monday, November 4, Facebook unveiled a new logo that will be used on the companys lists … [+2580 chars]"},{"source":{"id":null,"name":"Livejournal.com"},"author":null,"title":"Shining some light on the history of OS/2, Win9x and NT","description":"[Nicked from the FB Vintage Computer Club] Someone was claiming that the big innovation of OS/2 2 was that it used CPU protection rings, and that made it better than any version of Windows ever. XKCD 386 got me. Protection rings date back to  the 1960s or eve…","url":"https://liam-on-linux.livejournal.com/67492.html","urlToImage":"https://l-files.livejournal.net/og_image/10092558/263?v=1571509848","publishedAt":"2019-10-20T17:25:22Z","content":"[Nicked from the FB Vintage Computer Club]\r\nSomeone was claiming that the big innovation of OS/2 2 was that it used CPU protection rings, and that made it better than any version of Windows ever. XKCD 386 got me.\r\nProtection rings date back to  the 1960s or e… [+4828 chars]"},{"source":{"id":null,"name":"Facebook.design"},"author":"Facebook, Inc.","title":"Designing the Facebook Company Brand","description":"A new brand system designed for clarity, inspired by people.","url":"https://facebook.design/companybrand","urlToImage":"https://facebook.design/public/images/facebookbrand_share.png","publishedAt":"2019-11-04T16:21:54Z","content":"A new brand system designed for clarity, inspired by people.\r\nBy Zach Stubenvoll, Sam Halle, Andrew Stirk and Luke Woods\r\nFacebook started as a single app. Now, 15 years later, we offer a suite of products that help people connect to their friends and family,… [+4006 chars]"},{"source":{"id":"vice-news","name":"Vice News"},"author":"Lauren Kaori Gurley, Janus Rose","title":"Facebook Employees Have Launched Their First Major Protest Against Mark Zuckerberg","description":"As the tech industry transforms into a hotbed of employee dissent, Facebook employees have remained on the sidelines. Are they finally having their moment?","url":"https://www.vice.com/en_us/article/gyznxm/facebook-employees-have-launched-their-first-major-protest-against-mark-zuckerberg","urlToImage":"https://video-images.vice.com/articles/5db7559f83689c008d5c9e3a/lede/1572296878136-GettyImages-1182969866.jpeg?crop=1xw:0.84375xh;center,center&resize=1200:*","publishedAt":"2019-10-29T13:00:00Z","content":"Hundreds of Facebook employees have signed onto a letter protesting the companys decision last month to allow politicians to post false statements in advertisements on the social media site. \r\nOur current policies on fact checking people in political office, … [+3812 chars]"},{"source":{"id":"vice-news","name":"Vice News"},"author":"Sarah Emerson, Jason Koebler, Tim Marchman","title":"How Facebook Bought a Police Force","description":"Hundreds of pages of documents obtained by Motherboard show how Facebook is using the Menlo Park Police Department to reshape the city.","url":"https://www.vice.com/en_us/article/d3akm7/how-facebook-bought-a-police-force","urlToImage":"https://video-images.vice.com/articles/5dadfd266518eb000a8e0a67/lede/1571684069389-08_08_2019_FACEBOOK_COPS_CV.png?crop=1xw:1xh;center,center&resize=1200:*","publishedAt":"2019-10-23T13:00:00Z","content":"One evening in June 2015, a man left Facebooks sprawling technology campus in Menlo Park, California with two baby-blue bicycles. They were part of a shared fleet offered as a corporate perk; employees arent supposed to ride them off the property, but many ig… [+21221 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Jon Swartz","title":"Some 40 state AGs plan to take part in Facebook probe","description":"As many as 40 state attorneys general intend to join a New York-led investigation of Facebook Inc. for anti-competitive business practices, the latest and most potentially treacherous obstacle yet for the social-networking giant.","url":"https://www.marketwatch.com/story/some-40-state-ags-plan-to-take-part-in-facebook-probe-2019-10-07","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HS816_Facebo_ZG_20191007211737.jpg","publishedAt":"2019-10-08T02:14:33Z","content":"As many as 40 state attorneys general intend to join a New York-led investigation of Facebook Inc. for anti-competitive business practices, the latest and most potentially treacherous obstacle yet for the social-networking giant.\r\nSeveral attorneys general me… [+1375 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Victor Reklaitis","title":"The Number One: FAANG companies’ employees donate most often to this presidential candidate","description":"Here’s a look at the donations made in 2019 to seven top Democratic contenders and President Donald Trump by employees at Facebook, Amazon, Apple, Netflix and Alphabet’s Google plus Microsoft.","url":"https://www.marketwatch.com/story/faang-companies-employees-donate-most-often-to-this-presidential-candidate-2019-10-31","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HF613_FAANGP_ZG_20190313120931.jpg","publishedAt":"2019-10-31T17:24:41Z","content":"Democratic presidential hopeful Bernie Sanders is known for his tough talk around reforming Corporate America, but hes still winning one key popularity contest at giant tech companies.\r\nWhen it comes to contributions to 2020 White House contenders this year, … [+1391 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Jon Swartz","title":"Facebook unveils new tab in its mobile app dedicated to news stories","description":"Facebook Inc. is getting into the news business and paying publishers because it feels it imperative to support a democratic society.","url":"https://www.marketwatch.com/story/facebook-unveils-new-tab-in-its-mobile-app-dedicated-to-news-stories-2019-10-25","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HU034_Zuck_ZG_20191025115525.jpg","publishedAt":"2019-10-25T19:26:00Z","content":"Facebook Inc. is getting into the news business and paying publishers because it feels it imperative to support a democratic society.\r\nIts no secret the internet has really disrupted the new business model. I just think every internet platform has a responsib… [+1834 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Victor Reklaitis","title":"In One Chart: Marijuana industry’s lobbying hits record as banking bill hangs in the balance","description":"The cannabis industry has set a fresh record in its annual spending on lobbying Washington, with its outlay of $3.77 million through this year’s third quarter topping 2018’s full-year total of $2.76 million.","url":"https://www.marketwatch.com/story/marijuana-industrys-lobbying-hits-record-as-banking-bill-hangs-in-the-balance-2019-10-28","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HU166_cannab_ZG_20191028160811.jpg","publishedAt":"2019-10-28T19:37:40Z","content":"The cannabis industry has set a fresh record for its annual lobbying spending in Washington, with its outlay of $3.77 million through this years third quarter topping 2018s full-year total of $2.76 million.\r\nThe increased spending comes as the industry and it… [+2519 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Nigam Arora","title":"This chart shows how much Brexit matters to the U.S. stock market","description":"U.S. investors have brushed off geopolitical tension between the U.K. and the European Union.","url":"https://www.marketwatch.com/story/this-chart-shows-how-much-brexit-matters-to-the-us-stock-market-2019-10-17","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HR336_boris__ZG_20190916053157.jpg","publishedAt":"2019-10-17T15:13:50Z","content":"Many investors are getting excited about the Brexit deal. \r\nSome excitement is warranted because it took years of wrangling for the U.K. and the European Union to reach a deal at the last minute. However, all is not clear. Northern Irelands Democratic Unionis… [+3650 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Tanner Brown","title":"Rockets red glare: How Hong Kong protests became a political football for the Houston NBA team, its general manager and the league","description":"Withering criticism over perceived cowing to China following tweet in support of pro-democracy protesters.","url":"https://www.marketwatch.com/story/rockets-red-glare-how-hong-kong-protests-became-a-political-football-for-the-houston-nba-team-its-general-manager-and-the-league-2019-10-08","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HS738_morey1_ZG_20191006181322.jpg","publishedAt":"2019-10-09T21:27:16Z","content":"Daryl Morey had a bad weekend. The Houston Rockets general manager faced explosive backlash from China after he tweeted Friday in support of the Hong Kong protesters.\r\nThe since-deleted tweet contained an image reading: Fight for Freedom. Stand with Hong Kong… [+2867 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Meera Jagannathan","title":"Capitol Report: Sheryl Sandberg doubles down on Facebook’s political ad stance","description":"‘The revenue is not worth the controversy,’ the company’s COO said.","url":"https://www.marketwatch.com/story/sheryl-sandberg-doubles-down-on-facebooks-political-ad-stance-2019-10-31","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HU429_sandbe_ZG_20191031130840.jpg","publishedAt":"2019-10-31T17:04:23Z","content":"Facebook \r\nFB, +1.98%\r\n COO Sheryl Sandberg on Wednesday reiterated that the worlds biggest social media site considers political ads an important part of the dialogue rather than a financial incentive.\r\nSandberg echoed her boss, CEO Mark Zuckerberg, hours af… [+3654 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Tomi Kilgore","title":"The Ratings Game: Arista Networks’ stock suffers record plunge after ‘sudden and severe’ drop in cloud demand","description":"Shares of Arista Networks Inc. were suffering a record plunge Friday in the wake of a very downbeat revenue outlook, after another “cloud titan” customer informed the cloud networking company of a “material reduction” in orders.","url":"https://www.marketwatch.com/story/arista-networks-stock-suffers-record-plunge-after-sudden-and-severe-drop-in-cloud-demand-2019-11-01","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HI771_arista_ZG_20190502213152.jpg","publishedAt":"2019-11-01T15:48:38Z","content":"Shares of computer networking company Arista Networks Inc. were suffering a record plunge Friday in the wake of a very downbeat revenue outlook, after another cloud titan customer informed the cloud networking company of a material reduction in orders.\r\nThat … [+3986 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Barbara Kollmeyer","title":"Need to Know: How this media firm and oil giant will give your portfolio vital balance, says investment manager","description":"Our call of the day, from John Linehan, portfolio manager for T. Rowe Price’s Equity Income Fund, says if investors want to juggle all that could go right or wrong with the economy and otherwise right now, they need a balanced portfolio.","url":"https://www.marketwatch.com/story/how-this-media-firm-and-oil-giant-will-give-your-portfolio-vital-balance-says-investment-manager-2019-10-15","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HT250_strong_ZG_20191014110639.jpg","publishedAt":"2019-10-15T11:14:11Z","content":"The banks are coming.\r\nResults are rolling out from Goldman and others Tuesday, as earnings season arrives just in time to distract us from the trade-talk merry-go-round. Thats as Wall Street eyes a perkier start, with Dow \r\nYM00, +0.39%,\r\nS&amp;P 500 \r\nES00,… [+3908 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Nicole Lyn Pesce","title":"The Margin: Americans are spending almost half a billion on Halloween costumes for their pets","description":"Pet parents tell MarketWatch how they’re getting their furbabies into the Halloween spirit","url":"https://www.marketwatch.com/story/americans-are-spending-almost-half-a-billion-on-halloween-costumes-for-their-pets-2019-10-22","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HT789_PetHal_ZG_20191022114324.jpg","publishedAt":"2019-10-22T16:08:34Z","content":"Halloween or should we say Howl-o-ween is going to the dogs.\r\nAmericans will spend $490 million on costumes for their pets this Halloween, according to the National Retail Federation, which is more than double what they dropped to dress their dogs, cats and o… [+5624 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Therese Poletti","title":"MarketWatch First Take: Zuckerberg stands defiant on political ads, swinging ‘free expression’ at critics like a hammer","description":"Facebook Chief Executive Mark Zuckerberg came out swinging in the company’s earnings call Wednesday, defending his stance on allowing political advertisements on the world’s largest social network in a continuing strategy change from a defensive stance to an …","url":"https://www.marketwatch.com/story/zuckerberg-stands-defiant-on-political-ads-swinging-free-expression-at-critics-like-a-hammer-2019-10-30","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HF909_king_z_ZG_20190318185600.jpg","publishedAt":"2019-10-30T23:44:50Z","content":"Facebook Chief Executive Mark Zuckerberg came out swinging in the companys earnings call Wednesday, defending his stance on allowing political advertisements on the worlds largest social network in a continuing strategy change from a defensive stance to an as… [+4027 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Michael Ashbaugh","title":"The Technical Indicator: Bull ‘trend’ intact, S&P 500 inches toward record territory","description":"Technically speaking, the U.S. benchmarks’ bigger-picture backdrop remains bullish, and continues to strengthen, amid constructive October price action, writes Michael Ashbaugh.","url":"https://www.marketwatch.com/story/bull-trend-intact-sp-500-inches-toward-record-territory-2019-10-22-12103288","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HT795_spx102_MD_20191022120415.jpg","publishedAt":"2019-10-22T16:28:08Z","content":"Editors Note: This is a free edition of The Technical Indicator, a daily MarketWatch subscriber newsletter. To get this column each market day, click here.\r\nTechnically speaking, the U.S. benchmarks bigger-picture backdrop remains bullish, and continues to st… [+16801 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Ben Gilbert","title":"The 10 most-viewed fake-news stories on Facebook in 2019 were just revealed in a new report — take a look (FB)","description":"Fake news stories targeting American voters are still rife on Facebook, and a new investigation from Avaaz just revealed the 10 most-viewed in 2019.","url":"https://news.yahoo.com/10-most-viewed-fake-news-160602701.html","urlToImage":"https://s.yimg.com/ny/api/res/1.2/vN4cAEtPLX5Vy6Z_XHOjiQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/nV.f2GzbflGFCqnZIgWpDw--~B/aD0xNjAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/business_insider_articles_888/1b28345e71f1ffebe81cf490ba3e9065","publishedAt":"2019-11-06T16:06:02Z","content":"Mark Zuckerberg\r\nDrew Angerer/Getty Images\r\n<ul><li>Facebook is the largest social media service on the planet, with over 2 billion users over a quarter of the world's population.\r\n</li><li>As such, policing Facebook is a tremendous challenge. One of the serv… [+2257 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":"Tobias Hoonhout","title":"Hundreds of Facebook Employees Decry Zuckerberg’s Free Speech Stance in Letter","description":"Facebook employees published an internal letter several weeks ago that criticizes CEO Mark Zuckerberg's decision to allow politicians and other public officials to purchase ads that include false information.Quoting former Facebook chief product officer turne…","url":"https://news.yahoo.com/hundreds-facebook-employees-decry-zuckerberg-183318989.html","urlToImage":"https://s.yimg.com/ny/api/res/1.2/1f13h_4_MRFFaVfx4PMuoA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03NDYuMjU-/https://s.yimg.com/uu/api/res/1.2/PCLTHskRDPBOGld3xRL..A--~B/aD01OTc7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/3ce57623ac98faad0039543fc74caebb","publishedAt":"2019-10-28T18:33:18Z","content":"Facebook employees published an internal letter several weeks ago that criticizes CEO Mark Zuckerbergs decision to allow politicians and other public officials to purchase ads that include false information.\r\nQuoting former Facebook chief product officer turn… [+2347 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Jon Swartz","title":"Facebook’s new corporate logo comes amid federal scrutiny","description":"Social-networking giant Facebook unveils a generic logo as part of a rebranding push.","url":"https://www.marketwatch.com/story/facebooks-new-corporate-logo-comes-amid-federal-scrutiny-2019-11-04","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HU601_facebo_ZG_20191104115144.jpg","publishedAt":"2019-11-04T17:46:56Z","content":"Facbook Inc. has a new look.\r\nThe social-networking giant \r\nFB, +0.75%\r\n on Monday unveiled a generic logo as part of a rebranding push. The FACEBOOK logo that represents the parent company that owns core Facebook, Instagram, WhatsApp, and other properties. A… [+1226 chars]"},{"source":{"id":"the-wall-street-journal","name":"The Wall Street Journal"},"author":"Sahil Patel","title":"The Wall Street Journal: Facebook nears $40 million settlement in video-metrics lawsuit","description":"Facebook Inc. could pay $40 million to settle a lawsuit from advertisers over miscalculated video metrics.","url":"https://www.wsj.com/articles/facebook-reaches-proposed-settlement-in-video-measurement-lawsuit-11570482031","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HS077_Facebo_ZG_20190925170220.jpg","publishedAt":"2019-10-07T21:16:16Z","content":"Facebook Inc. could pay $40 million to settle a lawsuit from advertisers over miscalculated video metrics.\r\nThe legal battle began in 2016 after Facebook \r\nFB, -0.43%\r\n  disclosed it had incorrectly calculated the average viewing time for video ads on its pla… [+1155 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Jon Swartz","title":"Facebook shares rise 4% after earnings beat estimates","description":"Shares of Facebook Inc. jumped 4% in after-hours trading Wednesday after it announced third-quarter results that soundly beat analysts’ earnings estimates and topped revenue forecasts.","url":"https://www.marketwatch.com/story/facebook-shares-rise-4-after-earnings-beat-estimates-2019-10-30","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HU258_Facebo_MG_20191029152617.jpg","publishedAt":"2019-10-30T19:20:40Z","content":"Shares of Facebook Inc. jumped 4% in after-hours trading Wednesday after the company announced third-quarter results that soundly beat analysts earnings estimates and topped revenue forecasts. \r\nThe Menlo Park, Calif.-based company \r\nFB, -0.56%\r\nreported thir… [+1457 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Jeremy C. Owens","title":"Snap earnings show continued strong user growth, stock heads higher in late trading","description":"Snap Inc. shares gained Tuesday afternoon after an earnings report that showed continuing strong gains in users and revenue.","url":"https://www.marketwatch.com/story/snap-earnings-show-continued-strong-user-growth-stock-heads-higher-in-late-trading-2019-10-22","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-GY407_snap11_ZG_20181112173938.jpg","publishedAt":"2019-10-22T20:16:26Z","content":"Snap Inc. shares gained Tuesday afternoon following an earnings report that showed continued strong gains in users and revenue.\r\nSnap \r\nSNAP, -3.98%\r\n announced that active users increased by 7 million, a better-than-expected gain following Snapchats best qua… [+2008 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Emily Bary","title":"The Ratings Game: Roku stock tumbles as analysts say modest beats fail to justify massive rally","description":"Roku Inc.’s massive 2019 rally took a hit Thursday as the company failed to live up to what analysts said were high expectations.","url":"https://www.marketwatch.com/story/roku-stock-tumbles-as-analysts-say-modest-beats-fail-to-justify-massive-rally-2019-11-07","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HB120_Roku_ZG_20190102094209.jpg","publishedAt":"2019-11-07T16:04:24Z","content":"Roku Inc.s massive 2019 rally took a hit Thursday as the company failed to live up to what analysts said were high expectations. \r\nThough both revenue and earnings came in ahead of estimates for its latest quarter, the beats were smaller than what Roku \r\nROKU… [+3157 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Rachel Koning Beals","title":"In One Chart: Facebook, Visa among the stocks with high ESG marks — enough to outrun the S&P 500","description":"Companies that improve their environmental, social and governance reputations outperform the S&P 500 — big tech and financial services firms among them.","url":"https://www.marketwatch.com/story/facebook-visa-among-the-stocks-with-high-esg-marks-enough-to-outrun-the-sp-500-2019-10-18","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HT416_5_logo_ZG_20191016105109.jpg","publishedAt":"2019-10-18T15:21:28Z","content":"Companies that improve their environmental, social and governance reputations outperform the S&amp;P 500 major technology and financial services firms among them.\r\nThats according to researchers at FactSet, who broke out the S&amp;P 500 into deciles based on … [+2906 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Mike Murphy","title":"Key Words: AOC grills Zuckerberg over which lies are allowed in Facebook political ads","description":"Facebook Inc. Chief Executive Mark Zuckerberg got grilled by lawmakers on Capitol Hill on Wednesday, and some of the most pointed questioning came from Rep. Alexandria Ocasio-Cortez.","url":"https://www.marketwatch.com/story/aoc-grills-zuckerberg-over-which-lies-are-allowed-in-facebook-political-ads-2019-10-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HT893_aoc102_ZG_20191023191254.jpg","publishedAt":"2019-10-23T23:18:41Z","content":"Facebook Inc. Chief Executive Mark Zuckerberg got grilled by lawmakers on Capitol Hill on Wednesday, and some of the most pointed questioning came from Rep. Alexandria Ocasio-Cortez.\r\nDo you see a potential problem here with a complete lack of fact-checking o… [+2931 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Nigam Arora","title":"Momentum investors are now buying shares of Apple, Amazon and Netflix","description":"Money flows can point to opportunities and risks, says Nigam Arora.","url":"https://www.marketwatch.com/story/momentum-investors-are-now-buying-shares-of-apple-amazon-and-netflix-2019-10-15","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HT354_Amazon_ZG_20191015143233.jpg","publishedAt":"2019-10-15T18:54:33Z","content":"Earnings season has started. Wall Street is bullish on the first phase of President Trumps trade deal with China. The stock market is near highs after rising for a decade. At a time like this, its important to pay attention to the other side of the story. \r\nH… [+3677 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Jon Swartz","title":"Meg Whitman’s new venture is thinking big with a short-form streaming service","description":"Quibi, short for “quick bites,” is scheduled to launch in April with shows and films from A-list directors such as Steven Spielberg and Guillermo del Toro sliced into increments shorter than 10 minutes that are meant to be viewed on smartphones.","url":"https://www.marketwatch.com/story/meg-whitmans-new-venture-is-thinking-big-with-a-short-form-streaming-service-2019-10-22","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HT811_Whitma_ZG_20191022164925.jpg","publishedAt":"2019-10-22T21:37:10Z","content":"LAGUNA BEACH, Calif. Meg Whitman has seen the future of content and its on a very small screen. And in very short bursts.\r\nHer new venture Quibi, short for quick bites, is scheduled to launch in April with shows and films from A-list directors such as Steven … [+2793 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Nicole Lyn Pesce","title":"The Margin: This is why your Taco Bell was mysteriously out of beef over the weekend","description":"The Yum! Brands chain pulled 2.3 million pounds of seasoned meat over fears it was laced with metal shavings","url":"https://www.marketwatch.com/story/this-is-why-your-taco-bell-was-mysteriously-out-of-beef-over-the-weekend-2019-10-15","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HT314_TacoBe_ZG_20191015094822.jpg","publishedAt":"2019-10-15T14:25:07Z","content":"Taco Bell customers wondering where the beef has been for the past few days now have their answer. \r\nLast Friday, the Yum! Brands \r\nYUM, -0.18%\r\n chain quietly pulled about 2.3 million pounds of seasoned beef from restaurants in 21 states over concerns that i… [+2867 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Steve Goldstein","title":"Need to Know: Why one Fed watcher says the central bank needs to keep chopping interest rates","description":"Joseph LaVorgna, chief economist for the Americas at Natixis, tells MarketWatch that monetary policy is still too tight.","url":"https://www.marketwatch.com/story/why-one-fed-watcher-says-the-central-bank-needs-to-keep-chopping-interest-rates-2019-10-30","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HU279_chains_ZG_20191030045714.jpg","publishedAt":"2019-10-30T10:16:18Z","content":"Its Fed day, and the overwhelmingly (but not universal) consensus is that the U.S. central bank will cut interest rates by a quarter-point on Wednesday the third rate cut in a row.\r\nTo one long-time Fed watcher, thats still not enough.\r\nJoseph LaVorgna, chief… [+2811 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Barbara Kollmeyer","title":"Need to Know: These overlooked tech companies are more exciting than Apple, says ex-BlackRock manager","description":"Our call of the day says investors need to look past Facebook and Apple — even if those companies are whizzing higher after upbeat results — and put their money on the next big tech disrupters.","url":"https://www.marketwatch.com/story/these-overlooked-tech-companies-are-more-exciting-than-apple-says-ex-blackrock-manager-2019-10-31","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HU361_TIchip_ZG_20191031020707.jpg","publishedAt":"2019-10-31T09:48:23Z","content":"Relief over well-received results from Apple and Facebook may not be enough to fuel another S&amp;P 500 record on Thursday, as rumblings on the trade front are getting in the way.\r\nThose big tech names are an integral part of our call of the day from BlueBox … [+3732 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Nigam Arora","title":"Professional investors are selling stocks as international risks pile up","description":"An escalation with China and heated words with Turkey increase uncertainty.","url":"https://www.marketwatch.com/story/professional-investors-are-selling-stocks-as-international-risks-pile-up-2019-10-08","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HQ021_FN_HON_ZG_20190823034916.jpg","publishedAt":"2019-10-08T16:00:10Z","content":"The repression of human rights in China, limits on American money flowing to Chinese stocks and a mini-crisis in Turkey are beginning to weigh on the stock market. \r\nLets explore this issue with the help of two charts.\r\nTwo charts\r\nFor the first chart, please… [+5325 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Mark DeCambre","title":"Market Snapshot: Dow futures fall 100 points as Caterpillar results disappoint and Boeing, Microsoft on deck","description":"U.S. stock-index futures add to modest declines Wednesday morning after a weaker-than-expected report from Dow-component Caterpillar and poor update from a semiconductor company cast a cloud over the sector, with a fresh wave of corporate results ahead.","url":"https://www.marketwatch.com/story/dow-futures-fall-100-points-as-caterpillar-results-disappoint-and-boeing-microsoft-on-deck-2019-10-23","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-FW874_cat_ZG_20171024093548.jpg","publishedAt":"2019-10-23T11:32:43Z","content":"U.S. stock-index futures added to modest declines Wednesday morning after a weaker-than-expected report from Dow-component Caterpillar and poor update from a semiconductor company cast a cloud over the sector, with a fresh wave of corporate results ahead. \r\nW… [+5949 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Nigam Arora","title":"What individual investors can do after China and Wall Street won this round of the trade deal","description":"The most probable scenario is that the stock market will stay range-bound.","url":"https://www.marketwatch.com/story/what-individual-investors-can-do-after-china-and-wall-street-won-this-round-of-the-trade-deal-2019-10-14","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HN223_mnuchi_ZG_20190712110504.jpg","publishedAt":"2019-10-14T15:18:39Z","content":"On the surface it appears that China and Wall Street won this round of the trade deal. \r\nWho lost? It appears that the loser is America. China has taken advantage of the U.S. over the past 40 years. Lets discuss a potential game plan for investors with the he… [+4501 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Tanner Brown","title":"Why China’s TikTok has been drawing scrutiny from Zuckerberg and U.S. politicians","description":"Chinese-owned video-sharing app TikTok, which has exploded in popularity globally, has recently come under fire for censoring content that Beijing deems unacceptable.","url":"https://www.marketwatch.com/story/why-chinas-tiktok-has-been-drawing-scrutiny-from-zuckerberg-and-us-politicians-2019-10-18","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HT629_tiktok_ZG_20191018130414.jpg","publishedAt":"2019-10-18T19:48:48Z","content":"TikTok, the Chinese-owned video-sharing app, which has exploded in popularity globally, has recently come under fire for censoring content that Beijing deems unacceptable.\r\nFacebook Inc.s \r\nFB, -2.33%\r\nMark Zuckerberg and U.S. politicians have weighed in on t… [+4254 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Howard Gold","title":"Howard Gold's No-Nonsense Investing: Wall Street is way too paranoid about a President Elizabeth Warren","description":"A Warren administration would face big obstacles enacting its most ambitious plans.","url":"https://www.marketwatch.com/story/wall-street-is-way-too-paranoid-about-a-president-elizabeth-warren-2019-10-29","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HU163_warren_ZG_20191028153356.jpg","publishedAt":"2019-10-29T08:37:45Z","content":"As Sen. Elizabeth Warren (D-Mass.) has risen steadily in the polls to become the narrow front-runner for the Democratic presidential nomination, Wall Street has gotten more and more paranoid.\r\nThe doom-and-gloom talk of what a Warren Administration would brin… [+4895 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Mark DeCambre","title":"Market Snapshot: Why would the Fed cut interest rates a 3rd time in a row even as stocks near records? Investors may soon find out","description":"A scant few think that Jerome Powell & Co. will opt not to cut interest rates next week for a third time in as many gatherings of the rate-setting Federal Open Market Committee on Wednesday.","url":"https://www.marketwatch.com/story/why-would-the-fed-cut-interest-rates-a-3rd-time-in-a-row-even-as-stocks-near-records-investors-may-soon-find-out-2019-10-27","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HL957_arends_ZG_20190621175131.jpg","publishedAt":"2019-10-27T12:00:59Z","content":"Is three the magic number for Wall Street? Well soon find out. Only a few think that Jerome Powell &amp; Co. will not cut interest rates next week for a third time in as many gatherings of the rate-setting Federal Open Market Committee. \r\nMarket-based probabi… [+6442 chars]"},{"source":{"id":null,"name":"Marketwatch.com"},"author":"Beth Kindig","title":"Outside the Box: Roku remains a promising stock even after this year’s surge","description":"Roku is the most fairly valued pure play in the over-the-top space, writes Beth Kindig.","url":"https://www.marketwatch.com/story/roku-remains-a-promising-stock-even-after-this-years-surge-2019-11-06","urlToImage":"http://s.marketwatch.com/public/resources/MWimages/MW-HB120_Roku_ZG_20190102094209.jpg","publishedAt":"2019-11-06T10:28:56Z","content":"Roku is a company that has proven nearly every bearish prediction wrong with consistent revenue growth despite being surrounded by steep competition and tech heavyweights in over-the-top media. \r\nWill Roku\r\nROKU, -0.67%\r\nbeat earnings? It doesnt matter long t… [+7980 chars]"},{"source":{"id":null,"name":"Cnet.com"},"author":"Corinne Reichert","title":"Facebook is 'addictive, bad for us,' says Salesforce CEO - CNET","description":"Marc Benioff says the social media platform needs to be \"held accountable for propaganda.\"","url":"https://www.cnet.com/news/facebook-is-addictive-bad-for-us-says-salesforce-ceo/","urlToImage":"https://cnet2.cbsistatic.com/img/OuRTFSmFooRflzSwadCV9-V6BUk=/756x567/2019/07/30/27163252-b429-4e86-95e2-e8fa06b82912/facebook-american-flag-logo-2.jpg","publishedAt":"2019-10-16T21:57:22Z","content":"Calls to split up Facebook are growing.\r\nAngela Lang/CNET\r\nSalesforce CEO Marc Benioff has taken aim at Facebook, saying the social media giant must be held accountable for information posted on its site. Benioff was responding to Facebook CEO Mark Zuckerberg… [+2875 chars]"},{"source":{"id":null,"name":"Theregister.co.uk"},"author":"Kieren McCarthy","title":"FYI, we're now in the timeline where Facebook decides who is and isn't a politician on its 2bn-plus-person network","description":"It’s almost as if social media giant has ill-considered, naive, spectacularly stupid policies Comment Facebook’s controversial policy to exempt political ads from factual review has taken another dive after the social media giant appeared to state it gets to …","url":"https://www.theregister.co.uk/2019/10/30/facebook_decides_politician/","urlToImage":"https://regmedia.co.uk/2019/10/30/shutterstock_facebook_ads.jpg","publishedAt":"2019-10-30T19:37:27Z","content":"Comment Facebooks controversial policy to exempt political ads from factual review has taken another dive after the social media giant appeared to state it gets to decide which politicians the policy applies to.\r\nOne California marketer is so incensed at the … [+4687 chars]"},{"source":{"id":null,"name":"Diyphotography.net"},"author":"John Wilhelm","title":"My Facebook photography page was hacked and used to scam hundreds of people out of their money","description":"August 5th I received a message via facebook messenger in my johnwilhelmisaphotoholic-fb-page inbox. A man introducing himself as Adam Torres told me he would like to buy my fb page. I clearly remember how I was laughing about it with my wife (who is actually…","url":"https://www.diyphotography.net/my-facebook-photography-page-was-hacked-and-used-to-scam-hundreds-of-people-out-of-their-money/","urlToImage":"https://s23527.pcdn.co/wp-content/uploads/2019/10/facebook-hacked.jpg.optimal.jpg","publishedAt":"2019-10-09T15:21:09Z","content":"August 5th\r\nI received a message via facebook messenger in my johnwilhelmisaphotoholic-fb-page inbox. A man introducing himself as Adam Torres told me he would like to buy my fb page. I clearly remember how I was laughing about it with my wife (who is actuall… [+5684 chars]"},{"source":{"id":null,"name":"Jezebel.com"},"author":"Maria Sherman","title":"The Best Piece of Unsolicited Advice You’ve Ever Received","description":"It’s the freakin’ weekend, baby, and you made it—cause for celebration, I’d say.  What’s not joyous, however, is the fact that some nerd probably gave you unsolicited advice at some point in the last five days. People love to share their opinion with stranger…","url":"https://jezebel.com/the-best-piece-of-unsolicited-advice-you-ve-ever-receiv-1838887661","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/m4xgsf3acdhk2bhoip0o.jpg","publishedAt":"2019-10-11T22:00:00Z","content":"Its the freakin weekend, baby, and you made itcause for celebration, Id say. Whats not joyous, however, is the fact that some nerd probably gave you unsolicited advice at some point in the last five days. People love to share their opinion with strangers, eve… [+7288 chars]"},{"source":{"id":null,"name":"Avclub.com"},"author":"Andrew Paul on News, shared by Andrew Paul to The A.V. Club","title":"Even Facebook employees think Mark Zuckerberg's political ad policies are very, very bad","description":"Last week, Facebook mastermind Mark Zuckerberg answered questions on Capitol Hill about Project Libra, which is apparently his social media kingdom’s new, not-at-all bad idea foray into cryptocurrency. Things quickly took a turn, however, when a number of rep…","url":"https://news.avclub.com/even-facebook-employees-think-mark-zuckerbergs-politica-1839443739","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/g5mxgmoje4xvyehtyeo7.jpg","publishedAt":"2019-10-29T17:04:00Z","content":"Last week, Facebook mastermind Mark Zuckerberg answered questions on Capitol Hill about Project Libra, which is apparently his social media kingdoms new, not-at-all bad idea foray into cryptocurrency. Things quickly took a turn, however, when a number of repr… [+1952 chars]"},{"source":{"id":null,"name":"Petapixel.com"},"author":"John Wilhelm","title":"My Facebook Photography Page was Hacked and Used to Scam Hundreds of People","description":"Two months ago, popular photographer and digital artist John Wilhelm‘s Facebook was hacked. Below, he shares the step-by-step story of how the hack happened, and how the hacker used his very popular Facebook page to scam hundreds of his followers out of their…","url":"https://petapixel.com/2019/10/10/my-facebook-photography-page-was-hacked-and-used-to-scam-hundreds-of-people/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+PetaPixel+%28PetaPixel%29","urlToImage":"https://petapixel.com/assets/uploads/2019/10/facebook.jpg","publishedAt":"2019-10-10T15:52:37Z","content":"Two months ago, popular photographer and digital artist John Wilhelm‘s Facebook was hacked. Below, he shares the step-by-step story of how the hack happened, and how the hacker used his very popular Facebook page to scam hundreds of his followers out of their… [+5892 chars]"},{"source":{"id":null,"name":"Archdaily.com"},"author":"Pilar Caballero","title":"El Palomar House / FB+ estudio","description":"The house is located in Santiago de las Montañas on the street Juan de Salinas in the Las Palmas neighbourhood in Loja. It is built in 1950, and formerly known as \"The Old House\". El Palomar is a restoration and renovation project in which FB+estudio creates …","url":"https://www.archdaily.com/927613/el-palomar-house-fb-plus-estudio","urlToImage":"https://images.adsttc.com/media/images/5dc1/b002/3312/fd14/3300/173b/large_jpg/8.jpg?1572974578","publishedAt":"2019-11-05T16:00:00Z","content":"Cortesía de FB+ estudio\r\n+ 21\r\n<ul><li>\r\n</li><li>Area\r\nArea of this architecture project\r\nArea: 250.0 m2</li><li>Year\r\nCompletion year of this architecture project \r\nYear: 2019</li><li>Manufacturers\r\nBrands with products used in this architecture project \r\nM… [+2556 chars]"},{"source":{"id":null,"name":"Techmeme.com"},"author":null,"title":"Interview with Facebook CMO Antonio Lucio on how the company mulled changing its name, challenges of adding FB branding to messaging apps like WhatsApp, more (Kurt Wagner/Bloomberg)","description":"Kurt Wagner / Bloomberg : Interview with Facebook CMO Antonio Lucio on how the company mulled changing its name, challenges of adding FB branding to messaging apps like WhatsApp, more — - Social giant wants more people to know what products it owns — New logo…","url":"https://www.techmeme.com/191104/p21","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iKk9xP68Lvzo/v0/1200x675.jpg","publishedAt":"2019-11-04T17:30:01Z","content":null},{"source":{"id":"politico","name":"Politico"},"author":"clima@politico.com (Cristiano Lima)","title":"Why Facebook's plan to rescue journalism may not be enough","description":"Industry watchers say the news tab may do little to change the imbalance of power between the tech giant and media organizations.","url":"https://www.politico.com/news/2019/10/25/facebook-news-tab-058003","urlToImage":"https://static.politico.com/7f/22/f91c77354a8d85c319da4cdc0578/191025-mark-zukerberg-ap-773.jpg","publishedAt":"2019-10-25T22:33:13Z","content":"Heres a look at the biggest pitfalls facing Facebook and the media organizations that have signed on with the social network: \r\nPaying publishers probably won't lower the antitrust heat\r\nFacebook has struck deals with an undisclosed number of publishers to pa… [+6752 chars]"},{"source":{"id":"politico","name":"Politico"},"author":"sherman@politico.com (Jake Sherman)","title":"POLITICO Playbook: Democrats think they’ve found an impeachment hero","description":"And new congressional maps are ordered in North Carolina.","url":"https://www.politico.com/newsletters/playbook/2019/10/29/democrats-think-theyve-found-an-impeachment-hero-487537","urlToImage":"https://static.politico.com/bc/04/47e64938409ebeb334a0e0d4f2ae/gettyimages-1184009033.jpg","publishedAt":"2019-10-29T09:57:08Z","content":"DRIVING THE DAY\r\nCHICAGO, ILLINOIS - OCTOBER 28: U.S. President Donald Trump waves as he leaves the stage after addressing the International Association of Chiefs of Police (IACP) convention on October 28, 2019 in Chicago, Illinois. Trump is expected to atten… [+28428 chars]"},{"source":{"id":null,"name":"Archdaily.com"},"author":"Daniel Tapia","title":"FB+ estudio Office / FB+ estudio","description":"Located on the street Juan de Salinas in Loja, FB + is an architecture, design and construction studio whose fundamental focus is to develop multidisciplinary projects that allow the creation of spaces where sensations of the users are being intensified. The …","url":"https://www.archdaily.com/927903/fb-plus-estudio-office-fb-plus-estudio","urlToImage":"https://images.adsttc.com/media/images/5db9/8c2a/3312/fd7c/7e00/0356/large_jpg/1.jpg?1572441119","publishedAt":"2019-11-07T14:00:00Z","content":"© FB+ estudio\r\n+ 14\r\n<ul><li>\r\n</li><li>Area\r\nArea of this architecture project\r\nArea: 20.0 m2</li><li>Year\r\nCompletion year of this architecture project \r\nYear: 2018</li><li>Photographs\r\nPhotographs: FB+ estudio</li><li>Manufacturers\r\nBrands with products us… [+2244 chars]"},{"source":{"id":null,"name":"Petapixel.com"},"author":null,"title":"My Facebook Photography Page Was Hacked And Used To Scam Hundreds Of People","description":"Two months ago, popular photographer and digital artist John Wilhelm's Facebook was hacked. Below, he shares the step-by-step story of how the hack","url":"https://petapixel.com/2019/10/10/my-facebook-photography-page-was-hacked-and-used-to-scam-hundreds-of-people/","urlToImage":"https://petapixel.com/assets/uploads/2019/10/facebook.jpg","publishedAt":"2019-10-11T12:25:50Z","content":"Two months ago, popular photographer and digital artist John Wilhelm‘s Facebook was hacked. Below, he shares the step-by-step story of how the hack happened, and how the hacker used his very popular Facebook page to scam hundreds of his followers out of their… [+5892 chars]"},{"source":{"id":null,"name":"Medium.com"},"author":"Michael Waters","title":"Inside The Strange, Unlikely Battle For Clever Ticker Symbols","description":"What ticker symbols for Slack and POT reveal about how companies think about branding when they IPO.","url":"https://marker.medium.com/the-secret-science-of-how-much-your-companys-ticker-symbol-matters-93169536dd62","urlToImage":"https://miro.medium.com/freeze/focal/1200/632/48/41/1*8yiC1zlfZzIwaGe4pmmy2A.gif","publishedAt":"2019-10-31T19:51:42Z","content":"For a brief moment last February, a tiny Vancouver-based cannabis company was on top of the world. Weekend Unlimited, a self-described premium hemp brand that employs roughly a dozen people, had just won rights to one of the most coveted ticker symbols in Can… [+8499 chars]"},{"source":{"id":null,"name":"Techmeme.com"},"author":null,"title":"Facebook reports Q3 revenue of $17.7B, up 29% YoY; DAUs rose 9% YoY to 1.62B as MAUs rose 8% YoY to 2.45B; headcount increased 28% YoY to 43,030 (Facebook)","description":"Facebook : Facebook reports Q3 revenue of $17.7B, up 29% YoY; DAUs rose 9% YoY to 1.62B as MAUs rose 8% YoY to 2.45B; headcount increased 28% YoY to 43,030 — Facebook, Inc. (Nasdaq: FB) today reported financial results for the quarter ended September 30, 2019…","url":"https://www.techmeme.com/191030/p31","urlToImage":"http://www.techmeme.com/img/techmeme_sq328.png","publishedAt":"2019-10-30T20:09:48Z","content":null},{"source":{"id":null,"name":"Gadgetsnow.com"},"author":"Gadgets Now Bureau","title":"This is what FB wants to saywith its new logo","description":"In an attempt to clarify that Facebook is more than just about Facebook app, the social media giant has introduced a new logo along with a more distinctive branding for other  apps it owns like WhatsApp, Instagram, Oculus and Messenger. Facebook said, “This b…","url":"https://www.gadgetsnow.com/tech-news/this-is-what-facebook-wants-to-tell-you-with-its-brand-new-logo/articleshow/71909125.cms","urlToImage":"https://static.toiimg.com/photo/71908905.cms","publishedAt":"2019-11-04T17:07:05Z","content":"In an attempt to clarify that Facebook is more than just Facebook app, the social media giant has introduced a new logo along with a more distinctive branding for other apps. The company that owns popular platforms like WhatsApp, Instagram, Oculus and Messeng… [+1337 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Lubna Kably","title":"Google, FB may face tax in line with India biz","description":"Google, Facebook, Netflix etc. have a huge consumer base in several countries but no physical presence which is why Organisation for Economic Co-operation and Development has proposed a new global tax mechanism system for multinationals under which ‘some’ pro…","url":"https://timesofindia.indiatimes.com/business/india-business/google-fb-may-face-tax-in-line-with-india-biz/articleshow/71512193.cms","urlToImage":"https://static.toiimg.com/thumb/msid-71514874,width-1070,height-580,imgsize-173735,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2019-10-09T22:30:00Z","content":"MUMBAI: Multinational enterprises (MNEs) such as Google, Facebook, Amazon and Netflix (to name a few), which have a huge consumer base in several countries but no physical presence, may in the coming year or two be dealing with a new global tax mechanism.\r\nUn… [+4836 chars]"},{"source":{"id":null,"name":"Gadgetsnow.com"},"author":"Gadgets Now Bureau","title":"How 7k job cuts at Cognizant are 'linked' to FB","description":"Cognizant announced that its laying off 7,000 workers and exiting the content moderation business. One of the key client for Cognizant was Facebook and an investigative report earlier this year had revealed how those employees faced mental trauma among other …","url":"https://www.gadgetsnow.com/jobs/how-7000-job-cuts-at-cognizant-are-linked-to-facebook/articleshow/71846133.cms","urlToImage":"https://static.toiimg.com/photo/71846035.cms","publishedAt":"2019-11-01T03:00:03Z","content":null},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"The New York Times","title":"Read the Letter Facebook Employees Sent to Mark Zuckerberg About Political Ads","description":"Hundreds of Facebook employees signed a letter decrying the decision to let politicians post any claims they wanted — even false ones — in ads on the site.","url":"https://www.nytimes.com/2019/10/28/technology/facebook-mark-zuckerberg-letter.html","urlToImage":"https://static01.nyt.com/images/2019/10/28/business/28facebook-letter2/28facebook-letter2-facebookJumbo.jpg","publishedAt":"2019-10-28T17:24:24Z","content":"We are proud to work here.\r\nFacebook stands for people expressing their voice. Creating a place where we can debate, share different opinions, and express our views is what makes our app and technologies meaningful for people all over the world.\r\nWe are proud… [+5451 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"Matthew Rosenberg and Kevin Roose","title":"Trump Campaign Floods Web With Ads, Raking In Cash as Democrats Struggle","description":"That campaigns are now being fought largely online campaign is hardly a revelation, yet only one political party seems to have gotten the message.","url":"https://www.nytimes.com/2019/10/20/us/elections/trump-campaign-ads-democrats.html","urlToImage":"https://static01.nyt.com/images/2019/10/20/us/20digitalcampaign-web/20digitalcampaign-web-facebookJumbo.jpg","publishedAt":"2019-10-20T07:00:07Z","content":"In the wake of the 2016 election, some on the left sought an explanation for Mr. Trumps victory in the idea that his campaign had used shadowy digital techniques inspired by military-style psychological warfare a Weaponized AI Propaganda Machine, as one artic… [+2489 chars]"},{"source":{"id":null,"name":"Booooooom.com"},"author":"Jeff Hamada","title":"The Return of El Kartel’s “100 Amigos” Art Show","description":"For years Pablo Zamudio and his shop, El Kartel, have been a megaphone for arts and culture in the city of Vancouver, hosting countless shows and passionately supporting emerging artists. One of the first pieces of art I ever bought was in his shop. For me it…","url":"https://www.booooooom.com/2019/11/07/the-return-of-el-kartels-100-amigos-art-show/","urlToImage":"https://www.booooooom.com/wp-content/uploads/2019/11/100amigos-fb.jpg","publishedAt":"2019-11-07T13:07:34Z","content":"For years Pablo Zamudio and his shop, El Kartel, have been a megaphone for arts and culture in the city of Vancouver, hosting countless shows and passionately supporting emerging artists. One of the first pieces of art I ever bought was in his shop, and it wa… [+1083 chars]"},{"source":{"id":"the-hindu","name":"The Hindu"},"author":"Banishree Jena","title":"Mob gathers at police station over FB post","description":"A large mob gathered at the Worli police station late on Friday night, after a communally sensitive post started doing the rounds on social media. According to the Worli police, the people, who stay i","url":"https://www.thehindu.com/news/national/mob-gathers-at-police-station-over-fb-post/article29807827.ece","urlToImage":"https://www.thehindu.com/static/theme/default/base/img/og-image.jpg","publishedAt":"2019-10-26T17:00:28Z","content":"A large mob gathered at the Worli police station late on Friday night, after a communally sensitive post started doing the rounds on social media. \r\nAccording to the Worli police, the people, who stay in a slum pocket in Worli, reached the police station at a… [+1239 chars]"},{"source":{"id":null,"name":"Qz.com"},"author":"Jeremy B. Merrill","title":"Is Facebook planning to expose its microtargeting techniques for political ads?","description":"Quartz reviewed some new JavaScript code in Facebook's website and discovered references to plans to disclose more information about the choices political campaigns make to show ads to you -- or to hide them from you.","url":"https://qz.com/1732078/facebooks-political-ads-could-soon-become-more-transparent/","urlToImage":"https://cms.qz.com/wp-content/uploads/2019/10/AP_19290646098625.jpg?quality=75&strip=all&w=1400","publishedAt":"2019-10-21T16:54:27Z","content":"Newly-spotted code on a Facebook website suggests that the platform is preparing to take a leap forward in transparency around how political ads are targeted to its users. Facebook denies any change is afoot.\r\nMicrotargeting on Facebook allows progressive vot… [+5337 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Josh Constine","title":"Facebook staff demand Zuckerberg limit lies in politcal ads","description":"Submit campaign ads to fact checking, limit microtargeting, cap spending, observe silence periods, or at least warn users. Facebook should ban campaign ads. The sentiments echo what I called for in a TechCrunch opinion piece on October 13th calling on Faceboo…","url":"https://techcrunch.com/2019/10/28/facebook-employees-vs-ad-lies/","urlToImage":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png","publishedAt":"2019-10-28T19:48:34Z","content":"Submit campaign ads to fact checking, limit microtargeting, cap spending, observe silence periods, or at least warn users. These are the solutions Facebook employees put forward in an open letter pleading with CEO Mark Zuckerberg and company leadership to add… [+11350 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Facebook announces efforts to safeguard 2020 election, fight fake news","description":"Facebook is taking new efforts to fight fake news ahead of the 2020 elections.","url":"https://finance.yahoo.com/news/facebook-2020-election-fake-news-175101285.html","urlToImage":"https://s.yimg.com/uu/api/res/1.2/Qj7qfKoJXt9h_.OJ4YDb3Q--~B/aD0yNDc3O3c9MzcxNztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/2c634da0-f42a-11e9-bb7c-7cdf6e003ad0","publishedAt":"2019-10-21T17:51:01Z","content":"Facebook (FB) CEO Mark Zuckerberg on Monday announced a series of steps the social network is taking ahead of the 2020 U.S. presidential election to prevent interference from both foreign and domestic groups.\r\nThe changes include stepped up enforcement to com… [+4409 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":null,"title":"Twitter's political ads ban is a distraction from the real problem with platforms","description":"Sometimes it feels as if Internet platforms are turning everything upside down, from politics to publishing, culture to commerce, and of course swapping truth for lies. This week's bizarro reversal was the vista of Twitter CEO Jack Dorsey, a tech CEO famed fo…","url":"https://techcrunch.com/2019/11/02/twitters-political-ads-ban-is-a-distraction-from-the-real-problem-with-platforms/","urlToImage":"https://s.yimg.com/uu/api/res/1.2/Ayeiqm_GdOtRGAnbEg14rg--~B/aD05NDk7dz0xMjIxO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/techcrunch_350/71106418bddddd80cf5fecbeb5e7a783","publishedAt":"2019-11-02T16:00:42Z","content":"Sometimes it feels as if Internet platforms are turning everything upside down, from politics to publishing, culture to commerce, and of course swapping truth for lies.This week's bizarro reversal was the vista of Twitter CEO Jack Dorsey, a tech CEO famed for… [+19992 chars]"}]}